Tekla.Structures.Model.RebarSpacing.Offset
Defines parameters associated with the start and end of the spacing.

Tekla.Structures.Model.RebarSpacing.Offset.Automatic
Defines whether the offset distance is to be automatically calculated.

Tekla.Structures.Model.RebarSpacing.Offset.Type
Defines whether the distance is intended as a fixed or a minimum distance.

Tekla.Structures.Model.RebarSpacing.Offset.Distance
The distance.

Tekla.Structures.Model.RebarSpacing.Offset.#ctor(System.Boolean,System.Double)
Initializes a new instance of the Tekla.Structures.Model.RebarSpacing.Offset struct.
automatic: Whether or not the offset should be calculated automatically.
distance: The distance.

Tekla.Structures.Model.RebarSpacing.Offset.ToStruct(Tekla.Structures.ModelInternal.dotRebarSpacingOffset_t@)
Function used to convert offset data from the OpenAPI object to the core.
dotOffset: The offset data.

Tekla.Structures.Model.RebarSpacing.Offset.FromStruct(Tekla.Structures.ModelInternal.dotRebarSpacingOffset_t@)
Function used to convert offset data from the core to the OpenAPI object.
dotOffset: The offset data.